Autodesk.Revit.DB.LineConstraintOptions
Since:
2025
Indicates the line constraint behaviors.
Since:
2025

Autodesk.Revit.DB.LineConstraintOptions.ShiftUnConstrains
The movement is fixed to a direction when the shift key is released.

Autodesk.Revit.DB.LineConstraintOptions.ShiftConstrains
The movement is fixed to a direction when the shift key is pressed.

Autodesk.Revit.DB.LineConstraintOptions.Fixed
Movement is fixed to a direction.

Autodesk.Revit.DB.LineConstraintOptions.Unset
No constraint